sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
#ifdef CONFIG_REMOTEBSP_MOTION
static bool motion_pin_reserved(uint16_t encoded_pin) {
    for (uint8_t axis = 0U; axis < active_motion_axis_count; ++axis) {
        const rbsp_runtime_motion_axis_config_t* const config =
            &active_motion_axes[axis];
        if (config->step_pin == encoded_pin ||
            config->direction_pin == encoded_pin ||
            (config->enable_present && config->enable_pin == encoded_pin) ||
            config->limit_pin == encoded_pin) {
            return true;
        }
    }
    return false;
}
#endif

#if defined(CONFIG_REMOTEBSP_MOTION) || \
    defined(CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART)
static bool motion_slot_configuration_valid(void) {
    bool used[64] = {false};
#ifdef CONFIG_REMOTEBSP_MOTION
    bool enable_used[64] = {false};
    bool enable_active_low[64] = {false};
    for (uint8_t axis = 0U; axis < MOTION_SLOT_AXIS_COUNT; ++axis) {
        const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
        const uint16_t values[] = {
            (uint16_t)(pins->step.port * 16U + pins->step.pin),
            (uint16_t)(pins->direction.port * 16U + pins->direction.pin),
        };
        for (uint8_t index = 0U; index < 2U; ++index) {
            if (values[index] >= 64U || used[values[index]] ||
                !gpio_pin_present(values[index]) ||
                motion_pin_reserved_by_board(values[index])) {
                return false;
            }
            used[values[index]] = true;
        }
        const uint16_t enable = (uint16_t)(
            pins->enable.port * 16U + pins->enable.pin);
        if (enable >= 64U || !gpio_pin_present(enable) ||
            motion_pin_reserved_by_board(enable) ||
            (used[enable] && !enable_used[enable]) ||
            (enable_used[enable] &&
             enable_active_low[enable] != pins->enable_active_low)) {
            return false;
        }
        used[enable] = true;
        enable_used[enable] = true;
        enable_active_low[enable] = pins->enable_active_low;
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    if (!soft_uart_configuration_valid(used)) {
        return false;
    }
#endif
    return true;
}
#endif

static bool gpio_pin_allowed(uint16_t encoded_pin) {
    if (!gpio_pin_present(encoded_pin)) {
        return false;
    }
#ifdef CONFIG_REMOTEBSP_MOTION
    if (motion_pin_reserved(encoded_pin)) {
        return false;
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    if (soft_uart_pin_reserved(encoded_pin)) {
        return false;
    }
#endif
    return true;
}


#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
enum { RBSP_SOFT_UART_SLOT_CAPACITY = 5U };

static rbsp_soft_half_duplex_uart_t soft_uart;
static const bool default_soft_uart_port_present[RBSP_SOFT_UART_SLOT_CAPACITY] = {
#ifdef CONFIG_MOTION_SLOT0_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT1_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT2_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT3_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
#ifdef CONFIG_MOTION_SLOT4_DRIVER_TMC2209_UART
    true,
#else
    false,
#endif
};

static const uint8_t default_soft_uart_gpio_ports[RBSP_SOFT_UART_SLOT_CAPACITY] = {
#ifdef CONFIG_MOTION_SLOT0_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT0_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT1_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT1_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT2_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT2_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT3_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT3_TMC_UART_PIN / 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT4_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT4_TMC_UART_PIN / 16U,
#else
    0U,
#endif
};

static const uint8_t default_soft_uart_gpio_pins[RBSP_SOFT_UART_SLOT_CAPACITY] = {
#ifdef CONFIG_MOTION_SLOT0_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT0_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT1_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT1_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT2_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT2_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT3_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT3_TMC_UART_PIN % 16U,
#else
    0U,
#endif
#ifdef CONFIG_MOTION_SLOT4_DRIVER_TMC2209_UART
    CONFIG_MOTION_SLOT4_TMC_UART_PIN % 16U,
#else
    0U,
#endif
};

static bool soft_uart_port_present[RBSP_SOFT_UART_SLOT_CAPACITY];
static uint8_t soft_uart_gpio_ports[RBSP_SOFT_UART_SLOT_CAPACITY];
static uint8_t soft_uart_gpio_pins[RBSP_SOFT_UART_SLOT_CAPACITY];

static void soft_uart_load_default_mapping(void) {
    memcpy(soft_uart_port_present, default_soft_uart_port_present,
           sizeof(soft_uart_port_present));
    memcpy(soft_uart_gpio_ports, default_soft_uart_gpio_ports,
           sizeof(soft_uart_gpio_ports));
    memcpy(soft_uart_gpio_pins, default_soft_uart_gpio_pins,
           sizeof(soft_uart_gpio_pins));
}

static bool soft_uart_pin_reserved(uint16_t encoded_pin) {
    for (uint8_t port = 0U;
         port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
         port < RBSP_SOFT_UART_SLOT_CAPACITY;
         ++port) {
        if (soft_uart_port_present[port] &&
            encoded_pin == (uint16_t)(soft_uart_gpio_ports[port] * 16U +
                                      soft_uart_gpio_pins[port])) {
            return true;
        }
    }
    return false;
}

static bool soft_uart_configuration_valid(bool used[64]) {
    for (uint8_t port = 0U;
         port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
         port < RBSP_SOFT_UART_SLOT_CAPACITY;
         ++port) {
        if (!soft_uart_port_present[port]) {
            continue;
        }
        const uint16_t encoded_pin =
            (uint16_t)(soft_uart_gpio_ports[port] * 16U +
                       soft_uart_gpio_pins[port]);
        if (encoded_pin >= 64U || used[encoded_pin] ||
            !gpio_pin_present(encoded_pin) ||
            motion_pin_reserved_by_board(encoded_pin)) {
            return false;
        }
        used[encoded_pin] = true;
    }
    return true;
}

static GPIO_TypeDef* soft_uart_gpio(uint8_t port) {
    return port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
                   port < RBSP_SOFT_UART_SLOT_CAPACITY &&
                   soft_uart_port_present[port]
               ? gpio_port_from_index(soft_uart_gpio_ports[port])
               : NULL;
}

static uint16_t soft_uart_mask(uint8_t port) {
    return port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
                   port < RBSP_SOFT_UART_SLOT_CAPACITY &&
                   soft_uart_port_present[port]
               ? (uint16_t)(1U << soft_uart_gpio_pins[port])
               : 0U;
}

static bool soft_uart_port_prepare(void* context, uint8_t port) {
    (void)context;
    if (soft_uart_gpio(port) == NULL || soft_uart_mask(port) == 0U) {
        return false;
    }
    enable_gpio_clock(soft_uart_gpio_ports[port]);
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
    return true;
}

static bool soft_uart_set_input(void* context, uint8_t port) {
    (void)context;
    GPIO_TypeDef* const gpio = soft_uart_gpio(port);
    const uint16_t mask = soft_uart_mask(port);
    if (gpio == NULL || mask == 0U) {
        return false;
    }
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = GPIO_PULLUP;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
    return true;
}

