sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
    __HAL_UART_CLEAR_OREFLAG(&uart0_handle);
    __HAL_UART_ENABLE_IT(&uart0_handle, UART_IT_RXNE);
    __HAL_UART_ENABLE_IT(&uart0_handle, UART_IT_ERR);
    uart0_configured = true;
    HAL_NVIC_SetPriority(USART1_IRQn, 1U, 0U);
    HAL_NVIC_EnableIRQ(USART1_IRQn);
    return true;
}

static size_t board_hardware_uart_read(uint8_t port, uint8_t* data,
                                       size_t capacity) {
    if (port != 0U || !uart0_configured || data == NULL) {
        return 0U;
    }
    const uint32_t interrupt_state = __get_PRIMASK();
    __disable_irq();
    const size_t count =
        rbsp_byte_ring_read(&uart0_rx_ring, data, capacity);
    if (interrupt_state == 0U) {
        __enable_irq();
    }
    return count;
}

static bool board_hardware_uart_write(uint8_t port, const uint8_t* data,
                                      size_t length) {
    if (port != 0U || !uart0_configured || data == NULL ||
        length == 0U) {
        return false;
    }
    const uint32_t interrupt_state = __get_PRIMASK();
    __disable_irq();
    const bool accepted =
        rbsp_byte_ring_write_exact(&uart0_tx_ring, data, length);
    if (accepted) {
        __HAL_UART_ENABLE_IT(&uart0_handle, UART_IT_TXE);
    }
    if (interrupt_state == 0U) {
        __enable_irq();
    }
    return accepted;
}
#endif

#if CONFIG_UART_RESOURCE_COUNT > 0
static bool board_uart_configure(uint8_t port, uint32_t baud_rate,
                                 uint8_t data_bits, uint8_t stop_bits,
                                 uint8_t parity) {
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (port < CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
        return board_hardware_uart_configure(
            port, baud_rate, data_bits, stop_bits, parity);
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    return board_soft_uart_configure(
        (uint8_t)(port - CONFIG_TMC2209_UART_OBJECT_BASE),
        baud_rate, data_bits, stop_bits, parity);
#endif
    return false;
}

static size_t board_uart_read(uint8_t port, uint8_t* data,
                              size_t capacity) {
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (port < CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
        return board_hardware_uart_read(port, data, capacity);
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    return board_soft_uart_read(
        (uint8_t)(port - CONFIG_TMC2209_UART_OBJECT_BASE),
        data, capacity);
#endif
    return 0U;
}

static bool board_uart_write(uint8_t port, const uint8_t* data,
                             size_t length) {
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (port < CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
        return board_hardware_uart_write(port, data, length);
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    return board_soft_uart_write(
        (uint8_t)(port - CONFIG_TMC2209_UART_OBJECT_BASE),
        data, length);
#endif
    return false;
}
#endif

#ifdef CONFIG_REMOTEBSP_MOTION
static void motion_write_pin(motion_pin_t pin, bool high) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const uint16_t mask = (uint16_t)(1U << pin.pin);
    if (high) {
        gpio->BSRR = mask;
    } else {
        gpio->BRR = mask;
    }
}

static void motion_configure_output(motion_pin_t pin, bool initial_high) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const uint16_t mask = (uint16_t)(1U << pin.pin);
    enable_gpio_clock(pin.port);
    motion_write_pin(pin, initial_high);
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
}

static motion_pin_t motion_decode_pin(uint16_t encoded_pin) {
    const motion_pin_t pin = {
        (uint8_t)(encoded_pin / 16U), (uint8_t)(encoded_pin % 16U)};
    return pin;
}

static void motion_configure_limit_input(motion_pin_t pin,
                                         bool active_low) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    enable_gpio_clock(pin.port);
    GPIO_InitTypeDef init = {0};
    init.Pin = (uint16_t)(1U << pin.pin);
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = active_low ? GPIO_PULLUP : GPIO_PULLDOWN;
    init.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(gpio, &init);
}

static void motion_load_default_mapping(void) {
    memset(active_motion_axes, 0, sizeof(active_motion_axes));
    active_motion_axis_count = MOTION_SLOT_AXIS_COUNT;
    for (uint8_t axis = 0U; axis < MOTION_SLOT_AXIS_COUNT; ++axis) {
        const motion_axis_pins_t* const source = &motion_axis_pins[axis];
        rbsp_runtime_motion_axis_config_t* const destination =
            &active_motion_axes[axis];
        destination->logical_id = 0x09000000UL + axis;
        destination->maximum_step_rate_hz =
            CONFIG_MOTION_MAX_STEP_RATE_HZ;
        destination->step_pin = (uint16_t)(
            source->step.port * 16U + source->step.pin);
        destination->direction_pin = (uint16_t)(
            source->direction.port * 16U + source->direction.pin);
        destination->enable_pin = (uint16_t)(
            source->enable.port * 16U + source->enable.pin);
        destination->enable_present = true;
        destination->direction_inverted = source->direction_inverted;
        destination->enable_active_low = source->enable_active_low;
        destination->limit_pin = UINT16_MAX;
        active_motion_enable_group_ids[axis] =
            motion_enable_group_ids[axis];
    }
}

static void motion_apply_active_mapping(void) {
    memset(motion_enable_requests, 0, sizeof(motion_enable_requests));
    for (uint8_t axis = 0U; axis < active_motion_axis_count; ++axis) {
        const rbsp_runtime_motion_axis_config_t* const config =
            &active_motion_axes[axis];
        if (config->enable_present) {
            motion_configure_output(
                motion_decode_pin(config->enable_pin),
                config->enable_active_low);
            active_motion_enable_group_ids[axis] = config->enable_pin;
        } else {
            active_motion_enable_group_ids[axis] = UINT16_MAX;
        }
        motion_configure_output(motion_decode_pin(config->step_pin), false);
        motion_configure_output(
            motion_decode_pin(config->direction_pin),
            config->direction_inverted);
        if (config->limit_pin != UINT16_MAX) {
            motion_configure_limit_input(
                motion_decode_pin(config->limit_pin),
                config->limit_active_low);
        }
    }
}


/* 上电先关闭每一路 EN，再把 STEP 固定为低，避免初始化期间误动作。 */
static void motion_outputs_configure(void) {
    motion_load_default_mapping();
    motion_apply_active_mapping();
}

static bool board_motion_set_enable(uint8_t axis, bool enabled) {
    if (axis >= active_motion_axis_count) {
        return false;
    }
    const rbsp_runtime_motion_axis_config_t* const config =
        &active_motion_axes[axis];
    if (!config->enable_present) {
        return true;
    }
    bool group_enabled = false;
    if (!rbsp_motion_shared_enable_update(
            active_motion_enable_group_ids, motion_enable_requests,
            active_motion_axis_count, axis, enabled, &group_enabled)) {
        return false;
    }
    motion_write_pin(motion_decode_pin(config->enable_pin),
                     group_enabled != config->enable_active_low);
    return true;
}

